Revit 2027 API
SpotLightDistribution(Double, Double, Double) Constructor
 Creates a spot light distribution object with the given values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotLightDistribution(
	double spotBeamAngle,
	double spotFieldAngle,
	double tiltAngle
)
Public Sub New (
	spotBeamAngle As Double,
	spotFieldAngle As Double,
	tiltAngle As Double
)
public:
SpotLightDistribution(
	double spotBeamAngle,
	double spotFieldAngle,
	double tiltAngle
)
new :
        spotBeamAngle : float *
        spotFieldAngle : float *
        tiltAngle : float -> SpotLightDistribution
Parameters
spotBeamAngle Double
 The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
spotFieldAngle Double
 The spot field angle as a numerical value in radians between 0 and (8/9)*PI.
tiltAngle Double
 The tilt angle as a numerical value in radians between -PI and PI.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The angle is not valid because it is not between 1.0e-2 and 160.0. -or- The angle is not valid because it is not between -180.0 and 180.0.
See Also
Reference
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace